
Перем Утверждения;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	// Регистр ТоварыКОтгрзуке входит в функциональную опцию ИспользоватьОрдернуюСхемуПриОтгрузке
	// и поэтому не доступен в отчетах СКД
	НаборТестов.Добавить("ДоступностьРегистраТоварыКОтгрзуке");
	
КонецПроцедуры

Процедура ДоступностьРегистраТоварыКОтгрзуке() Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыНакопления.ТоварыКОтгрузке;
	Результат = ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектМетаданных);
	
	Утверждения.ПроверитьИстину(Результат, "Регистр не доступен по функ. опциям")
	
КонецПроцедуры

