&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем ГенераторТестовыхДанных;
&НаКлиенте
Перем ЗапросыИзБД;
&НаКлиенте
Перем УтвержденияПроверкаТаблиц;

&НаКлиенте
Перем Форма;

#Область ЮнитТестирование

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("ВыработкаСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаТеста() Экспорт
	
	Попытка
		Форма.Закрыть();
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыработкаСотрудников() Экспорт
	
	Макет = ПолучитьМакет();
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет,,, Истина);
	
	Параметрыформы = Новый Структура;
	Параметрыформы.Вставить("Ключ", СтруктураДанных.ВыработкаСотрудников1);
	
	Форма = ПолучитьФорму("Документ.ВыработкаСотрудников.ФормаОбъекта", ПараметрыФормы);
	Форма.Открыть();
	
	Утверждения.ПроверитьРавенство(Форма.Элементы._ДлительностьРаботДокумента.Видимость, Истина, "Нет колонки ДлительностьРаботДокумента");
	
	Форма.Элементы.СтраницыДокумента.ТекущаяСтраница = Форма.Элементы.СтраницаВидыРаботСотрудники;
	Утверждения.ПроверитьРавенство(Форма.Элементы.Сотрудники_РольИсполнителяРабот.Видимость, Истина, "Нет колонки ТЧ РольИсполнителяРабот");
	Утверждения.ПроверитьРавенство(Форма.Элементы.Сотрудники_ДлительностьРаботСотрудника.Видимость, Истина, "Нет колонки ТЧ ДлительностьРаботСотрудника");
	
	Форма._ДлительностьРаботДокументаПриИзменении(Форма.Элементы._ДлительностьРаботДокумента);
	
	СтрокаТЧ = Форма.Объект.Сотрудники[0];
	Форма.Элементы.Сотрудники.ТекущаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
	
	Форма.Сотрудники_ДлительностьРаботСотрудникаПриИзменении(Форма.Элементы.Сотрудники_ДлительностьРаботСотрудника);
	Форма.Сотрудники_РольИсполнителяРаботПриИзменении(Форма.Элементы.Сотрудники_РольИсполнителяРабот);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ЗаполнитьСотрудниковПоСоставуБригады(Объект)
	
	Документы.ВыработкаСотрудников.ЗаполнитьСотрудниковПоСоставуБригады(Объект, Неопределено, Истина);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ПровестиДокумент(Ссылка)
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
КонецФункции	

&НаСервере
Функция ПолучитьМакет()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМакет("Данные");
	
КонецФункции

