Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

Перем СтруктураДанных;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
	СтруктураДанных = ПолучитьСтруктуруДанных();
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	//НаборТестов.НачатьГруппу("Тестовый сценарий", Истина);
	НаборТестов.Добавить("СчетФактура");
	НаборТестов.Добавить("Акт");
	НаборТестов.Добавить("РТУ");
	НаборТестов.Добавить("РасчетСебестоимости");
	НаборТестов.Добавить("РаспределениеМатериалов");
	НаборТестов.Добавить("СборкаТоваров");
	НаборТестов.Добавить("ВыпускПродукции");
	НаборТестов.Добавить("ПередачаМатериаловВПроизводство");
	НаборТестов.Добавить("КорректировкаЗаказаМатериаловВПроизводство");
	НаборТестов.Добавить("ПеремещениеТоваров");
	НаборТестов.Добавить("ЗаказНаПеремещение");
	НаборТестов.Добавить("МаршрутныйЛист");
	НаборТестов.Добавить("ЗаказНаПроизводство");
	НаборТестов.Добавить("Калькуляция");
	НаборТестов.Добавить("Спецификация");
	НаборТестов.Добавить("СчетФактурыПолученные");
	НаборТестов.Добавить("ПТУ");
	НаборТестов.Добавить("КлючиАналитики");
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Процедура СчетФактура() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура Акт() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура РТУ() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура РасчетСебестоимости() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	Запрос.Параметры.Вставить("Дата",        '2016-01-01');
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.РасчетСебестоимостиТоваров КАК Док
	|ГДЕ
	|	Док.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(Док.Дата, Месяц) = &Дата";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.РегламентнаяОперация КАК Док
	|ГДЕ
	|	Док.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(Док.Дата, МЕСЯЦ) = &Дата";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура РаспределениеМатериалов() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация",  СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.РаспределениеПроизводственныхЗатрат КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура СчетФактурыПолученные() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация",  СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ПТУ() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация",  СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ПеремещениеТоваров() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ПередачаМатериаловВПроизводство() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ПередачаМатериаловВПроизводство КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ЗаказНаПеремещение() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура СборкаТоваров() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация",  СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.СборкаТоваров КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ВыпускПродукции() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация",  СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура МаршрутныйЛист() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.МаршрутныйЛистПроизводства КАК Док
	|ГДЕ
	|	Док.Распоряжение.Организация В (&Организация)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура КорректировкаЗаказаМатериаловВПроизводство() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.КорректировкаЗаказаМатериаловВПроизводство КАК Док
	|ГДЕ
	|	Док.Организация В(&Организация)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ЗаказНаПроизводство() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК Док
	|ГДЕ
	|	Док.Организация В(&Организация)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура Калькуляция() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ПлановаяКалькуляция.ДействиеКалькуляции КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК Спр
	|		ПО Док.Объект = Спр.Ссылка
	|ГДЕ
	|	Спр.Родитель = &Родитель";
	
	Запрос.Параметры.Вставить("Родитель", СтруктураДанных.СпецификацияГруппа);
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура Спецификация() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК Спр
	|ГДЕ
	|	Спр.Родитель = &Родитель";
	
	Запрос.Параметры.Вставить("Родитель", СтруктураДанных.СпецификацияГруппа);
	Запрос.Выполнить();
	
	МассивСпецификаций = Запрос.Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос.Параметры.Вставить("Спецификация", МассивСпецификаций);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Справочник.ЭтапыПроизводства КАК Док
	|ГДЕ
	|	Док.Владелец В (&Спецификация)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
	Для каждого Спецификация из МассивСпецификаций Цикл
		УдалитьОбъект(Спецификация);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ВводОстатков() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ВводОстатков КАК Док
	|ГДЕ
	|	Док.Организация В(&Организация)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
	Для каждого Спецификация из СтруктураДанных.МассивСпецификаций Цикл
		УдалитьОбъект(Спецификация);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура КлючиАналитики() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("МассивНоменклатуры", СтруктураДанных.МассивНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка,
	|	Спр.Номенклатура,
	|	Спр.Характеристика,
	|	Спр.Серия,
	|	Спр.Склад
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК Спр
	|ГДЕ
	|	Спр.Номенклатура В(&МассивНоменклатуры)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	Для каждого СтрокаТЗ из Таблица Цикл
		
		Запись = РегистрыСведений.АналитикаУчетаНоменклатуры.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЗ);
		Запись.Удалить();
		
	КонецЦикла;	
	
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Функция УдалитьОбъектыИзТаблицы(Таблица)
	
	Для каждого СтрокаТЗ из Таблица Цикл
		
		УдалитьОбъект(СтрокаТЗ.Ссылка);
		
	КонецЦикла;	
	
КонецФункции	

Функция УдалитьОбъект(Ссылка)
	
	Объект = Ссылка.ПолучитьОбъект();
	
	Если Объект <> Неопределено Тогда
		Объект.Удалить();
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьСтруктуруДанных()
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Данные");
	
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(Структура.Материал1);
	МассивНоменклатуры.Добавить(Структура.Материал2);
	МассивНоменклатуры.Добавить(Структура.Продукция);
	
	Структура.Вставить("МассивНоменклатуры", МассивНоменклатуры);
	
	Возврат Структура;
	
КонецФункции




