Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

Перем СтруктураДанных;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.НачатьГруппу("Создание справочников", Истина);
	НаборТестов.Добавить("Статьи");
	НаборТестов.Добавить("Организация");
	НаборТестов.Добавить("Подразделение");
	НаборТестов.Добавить("Склады");
	НаборТестов.Добавить("ОбеспечениеПотребностей");
	НаборТестов.Добавить("Контрагенты");
	НаборТестов.Добавить("Номенклатура");
	НаборТестов.Добавить("ГрафикРаботыПредприятия");
	НаборТестов.Добавить("Сотрудники");
	НаборТестов.Добавить("Прочее");
	НаборТестов.Добавить("ДопПараметрыОбъектов");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Процедура Организация() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Организация");
	
КонецПроцедуры

Процедура ОбеспечениеПотребностей() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "ОбеспечениеПотребностей");
	
КонецПроцедуры

Процедура Подразделение() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Подразделение");
	
КонецПроцедуры

Процедура Номенклатура() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "ВидыНоменклатуры,Номенклатура");
	
КонецПроцедуры

Процедура Статьи() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Статьи");
	
КонецПроцедуры

Процедура Контрагенты() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Контрагенты");
	
КонецПроцедуры

Процедура Склады() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Склады");
	
КонецПроцедуры

Процедура ГрафикРаботыПредприятия() Экспорт
	
	Календарь = Константы.ОсновнойКалендарьПредприятия.Получить();
	Если НЕ ЗначениеЗаполнено(Календарь) Тогда
		ВызватьИсключение "Не указан основной график работы предприятия" + Символы.ПС +
		"НСИ и Администрирование > Настройки параметров системы > Предприятие > Орнгаизации > График работы предприятия";
	КонецЕсли;	
	
	ДанныеПроизводственногоКалендаря = Справочники.ПроизводственныеКалендари.ДанныеПроизводственногоКалендаря(Календарь.ПроизводственныйКалендарь, 2016);
	Если ДанныеПроизводственногоКалендаря.Количество() = 0 Тогда
		ДанныеПроизводственногоКалендаря = Справочники.ПроизводственныеКалендари.РезультатЗаполненияПроизводственногоКалендаряПоУмолчанию(Календарь.ПроизводственныйКалендарь.Код, 2016);
		Справочники.ПроизводственныеКалендари.ЗаписатьДанныеПроизводственногоКалендаря(Календарь.ПроизводственныйКалендарь, 2016, ДанныеПроизводственногоКалендаря);
	КонецЕсли;	
	
	КалендарьОбъект = Календарь.ПолучитьОбъект();
	КалендарьОбъект.ДатаОкончания = Макс(КалендарьОбъект.ДатаОкончания, '2016-12-31');
	КалендарьОбъект.Записать();
	
КонецПроцедуры

Процедура Сотрудники() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Сотрудники");
	
	ДокументОбъект = Структура.УтверждениеШтатногоРасписания.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура Прочее() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Прочее");
	
КонецПроцедуры

Процедура ДопПараметрыОбъектов() Экспорт
	
	// Организации
	Ссылка = Справочники.Организации.НайтиПоНаименованию("Организация (Авто-тест)");
	СпрОбъект = Ссылка.ПолучитьОбъект();
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Наименование ENG (Организации)");
	
	ДобавитьСвойство(СпрОбъект, Свойство, "Company LLC");
	СпрОбъект.Записать();
	
	// Номенклатура
	Ссылка = Справочники.Номенклатура.НайтиПоНаименованию("Продукция товар с характеристиками (Авто-тест)");
	СпрОбъект = Ссылка.ПолучитьОбъект();
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Описание товара ENG (Номенклатура)");
	
	ДобавитьСвойство(СпрОбъект, Свойство, "Продукция ENG");
	СпрОбъект.Записать();
	
КонецПроцедуры	

Процедура ДобавитьСвойство(СпрОбъект, Свойство, Значение)
	
	НайденнаяСтрока = СпрОбъект.ДополнительныеРеквизиты.Найти(Свойство, "Свойство");
	Если НайденнаяСтрока = Неопределено Тогда
		НайденнаяСтрока = СпрОбъект.ДополнительныеРеквизиты.Добавить();
		НайденнаяСтрока.Свойство = Свойство;
	КонецЕсли;	
	
	НайденнаяСтрока.Значение = Значение;
	
КонецПроцедуры	

