Перем юТест;
Перем СтруктураДанных;

#Область ЮнитТестирование

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("Спецификация");
	ВсеТесты.Добавить("Калькуляция");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ПередЗапускомНабораТестов() Экспорт
	
	СтруктураДанных = ПолучитьСтруктуруДанных();
	
КонецПроцедуры

Процедура ПослеЗапускаНабораТестов() Экспорт
	
	
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Процедура Спецификация() Экспорт
	
	Структура = юТест.СоздатьДанныеПоМакетам(ЭтотОбъект, "Этап,Спецификация");
	
КонецПроцедуры

Процедура Калькуляция() Экспорт
	
	Структура = юТест.СоздатьДанныеПоМакетам(ЭтотОбъект, "Калькуляция");
	
	ДокументОбъект = Структура.Калькуляция.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция ПолучитьСтруктуруДанных()
	
	Структура = Новый Структура;
	
	Возврат Структура;
	
КонецФункции



