
&НаСервере
Процедура ОтладкаНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.СтруктураДанных = Новый Структура;
	ОбработкаОбъект.СтруктураДанных.Вставить("Организация",   Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("826d44d7-d70b-11e5-80c8-00155d01cd0e")));	
	ОбработкаОбъект.СтруктураДанных.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("b46e00f0-d70b-11e5-80c8-00155d01cd0e")));	
	ОбработкаОбъект.СтруктураДанных.Вставить("Склад",         Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("9e35d959-c17e-11e4-8400-005056b03126")));	
	
	ОбработкаОбъект.ПередачаМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура Отладка(Команда)
	ОтладкаНаСервере();
КонецПроцедуры
