&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем ГенераторТестовыхДанных;
&НаКлиенте
Перем ЗапросыИзБД;
&НаКлиенте
Перем УтвержденияПроверкаТаблиц;

#Область ЮнитТестирование

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("КнопкаВводНаОснованииЗаказаПоставщику");
	НаборТестов.Добавить("ВводНаОснованииЗаказаПоставщику");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КнопкаВводНаОснованииЗаказаПоставщику() Экспорт
	
	Макет = ПолучитьМакет();
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет,,, Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СтруктураДанных.ЗаказПоставщику1);
	
	Форма = ПолучитьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", ПараметрыФормы);
	Форма.Открыть();
	
	ЕстьКнопка = Ложь;
	Для каждого Элемент ИЗ Форма.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И Найти(Элемент.Имя, "ПоступлениеУслугПрочихАктивов") > 0 Тогда
			
			ЕстьКнопка = Истина;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Утверждения.ПроверитьРавенство(ЕстьКнопка, Истина, "Нет кнопки Ввод на основании Поступление прочих услуг");
	
	Форма.Закрыть();
	
КонецПроцедуры	

&НаКлиенте
Процедура ВводНаОснованииЗаказаПоставщику() Экспорт
	
	Макет = ПолучитьМакет();
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет,,, Истина);
	
	КолвоСтрок = ВводНаОснованииЗаказаСервер(СтруктураДанных.ЗаказПоставщику1);
	Утверждения.ПроверитьРавенство(КолвоСтрок, 1, "Не заполнилась ТЧ Расходы");
	
КонецПроцедуры	

&НаСервере
Функция ВводНаОснованииЗаказаСервер(ЗаказПоставщику) Экспорт
	
	ДокументОбъект = Документы.ПоступлениеУслугПрочихАктивов.СоздатьДокумент();
	ДокументОбъект.Заполнить(ЗаказПоставщику);
	
	Возврат ДокументОбъект.Расходы.Количество();
	
КонецФункции

&НаСервере
Функция ПолучитьМакет()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМакет("Данные");
	
КонецФункции

