Перем юТест;
Перем СтруктураДанных;

#Область ЮнитТестирование

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("СчетФактура");
	ВсеТесты.Добавить("Акт");
	ВсеТесты.Добавить("РасчетСебестоимости");
	ВсеТесты.Добавить("ВыпускПродукции");
	ВсеТесты.Добавить("ПередачаМатериаловВПроизводство");
	ВсеТесты.Добавить("ПеремещениеТоваров");
	ВсеТесты.Добавить("ЗаказНаПеремещение");
	//ВсеТесты.Добавить("КорректировкаЗаказаМатериаловВПроизводство");
	ВсеТесты.Добавить("МаршрутныйЛист");
	ВсеТесты.Добавить("ЗаказНаПроизводство");
	ВсеТесты.Добавить("Калькуляция");
	ВсеТесты.Добавить("Спецификация");
	ВсеТесты.Добавить("ПТУ");
	//ВсеТесты.Добавить("ВводОстатков");
	ВсеТесты.Добавить("КлючиАналитики");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ПередЗапускомНабораТестов() Экспорт
	
	СтруктураДанных = ПолучитьСтруктуруДанных();
	
КонецПроцедуры

Процедура ПослеЗапускаНабораТестов() Экспорт
	
	
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Процедура СчетФактура() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура Акт() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура РасчетСебестоимости() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	Запрос.Параметры.Вставить("Дата",        '2016-01-01');
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.РасчетСебестоимостиТоваров КАК Док
	|ГДЕ
	|	Док.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(Док.Дата, Месяц) = &Дата";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.РегламентнаяОперация КАК Док
	|ГДЕ
	|	Док.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(Док.Дата, МЕСЯЦ) = &Дата";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ПТУ() Экспорт
	
	УдалитьОбъект(СтруктураДанных.ПоступлениеТоваровИУслуг);
	
КонецПроцедуры	

Процедура ПеремещениеТоваров() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ПередачаМатериаловВПроизводство() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ПередачаМатериаловВПроизводство КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ЗаказНаПеремещение() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК Док
	|ГДЕ
	|	Док.Организация = &Организация";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ВыпускПродукции() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация",  СтруктураДанных.Организация);
	Запрос.Параметры.Вставить("МассивЗаказов", СтруктураДанных.МассивЗаказов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК Док
	|ГДЕ
	|	Док.Организация = &Организация
	|	И Док.Распоряжение.Распоряжение В (&МассивЗаказов)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура МаршрутныйЛист() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("МассивЗаказов", СтруктураДанных.МассивЗаказов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Документ.МаршрутныйЛистПроизводства КАК Док
	|ГДЕ
	|	Док.Распоряжение В (&МассивЗаказов)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура КорректировкаЗаказаМатериаловВПроизводство() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("МассивЗаказов", СтруктураДанных.МассивЗаказов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Документ.КорректировкаЗаказаМатериаловВПроизводство КАК Док
	|ГДЕ
	|	Док.Распоряжение В (&МассивЗаказов)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура ЗаказНаПроизводство() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("МассивЗаказов", СтруктураДанных.МассивЗаказов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК Док
	|ГДЕ
	|	Док.Ссылка В(&МассивЗаказов)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Процедура Калькуляция() Экспорт
	
	УдалитьОбъект(СтруктураДанных.Калькуляция);
	
КонецПроцедуры	

Процедура Спецификация() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Спецификация", СтруктураДанных.МассивСпецификаций);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка
	|ИЗ
	|	Справочник.ЭтапыПроизводства КАК Док
	|ГДЕ
	|	Док.Владелец В (&Спецификация)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
	Для каждого Спецификация из СтруктураДанных.МассивСпецификаций Цикл
		УдалитьОбъект(Спецификация);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ВводОстатков() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", СтруктураДанных.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ВводОстатков КАК Док
	|ГДЕ
	|	Док.Организация В(&Организация)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	УдалитьОбъектыИзТаблицы(Таблица);
	
	Для каждого Спецификация из СтруктураДанных.МассивСпецификаций Цикл
		УдалитьОбъект(Спецификация);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура КлючиАналитики() Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("МассивНоменклатуры", СтруктураДанных.МассивНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка,
	|	Спр.Номенклатура,
	|	Спр.Характеристика,
	|	Спр.Серия,
	|	Спр.Склад
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК Спр
	|ГДЕ
	|	Спр.Номенклатура В(&МассивНоменклатуры)";
	
	Запрос.Выполнить();
	Таблица = Запрос.Результат.Выгрузить();
	Для каждого СтрокаТЗ из Таблица Цикл
		
		Запись = РегистрыСведений.АналитикаУчетаНоменклатуры.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЗ);
		Запись.Удалить();
		
	КонецЦикла;	
	
	УдалитьОбъектыИзТаблицы(Таблица);
	
КонецПроцедуры	

Функция УдалитьОбъектыИзТаблицы(Таблица)
	
	Для каждого СтрокаТЗ из Таблица Цикл
		
		УдалитьОбъект(СтрокаТЗ.Ссылка);
		
	КонецЦикла;	
	
КонецФункции	

Функция УдалитьОбъект(Ссылка)
	
	Объект = Ссылка.ПолучитьОбъект();
	
	Если Объект <> Неопределено Тогда
		Объект.Удалить();
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьСтруктуруДанных()
	
	Структура = юТест.СоздатьДанныеПоМакетам(ЭтотОбъект, "Данные");
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(Структура.ЗаказНаПроизводство1);
	МассивЗаказов.Добавить(Структура.ЗаказНаПроизводство2);
	
	Структура.Вставить("МассивЗаказов", МассивЗаказов);
	
	
	МассивСпецификаций = Новый Массив;
	МассивСпецификаций.Добавить(Структура.Спецификация1);
	МассивСпецификаций.Добавить(Структура.Спецификация2);
	
	Структура.Вставить("МассивСпецификаций", МассивСпецификаций);
	
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(Структура.Материал1);
	МассивНоменклатуры.Добавить(Структура.Материал2);
	МассивНоменклатуры.Добавить(Структура.Продукция);
	
	Структура.Вставить("МассивНоменклатуры", МассивНоменклатуры);
	
	Возврат Структура;
	
КонецФункции



