&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем ГенераторТестовыхДанных;
&НаКлиенте
Перем ЗапросыИзБД;
&НаКлиенте
Перем УтвержденияПроверкаТаблиц;

&НаКлиенте
Перем Форма;

#Область ЮнитТестирование

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("КоличествоМест");
	НаборТестов.Добавить("КоличествоМестОбеспечение");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаТеста() Экспорт
	
	Попытка
		Форма.Закрыть();
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КоличествоМест() Экспорт
	
	Макет = ПолучитьМакет();
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СтруктураДанных.ЗаказКлиента1);
	
	Форма = ПолучитьФорму("Документ.ЗаказКлиента.ФормаОбъекта", ПараметрыФормы);
	Форма.Открыть();
	
	Утверждения.ПроверитьРавенство(Форма.Элементы._КоличествоМест.Видимость, Истина, "Нет поля Количество мест");
	Утверждения.ПроверитьРавенство(Форма.Элементы.Товары.Подвал, Истина, "Нет подвала");
	
	СтрокаТЧ = Форма.Объект.Товары[0];
	СтрокаТЧ._КоличествоМест = 1;
	
	Форма.Элементы.Товары.ТекущаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
	Форма._КоличествоМестПриИзменении(Форма.Элементы._КоличествоМест);
	
	Утверждения.ПроверитьРавенство(0.5, СтрокаТЧ.Количество, "Не рассчиталось количество");
	Утверждения.ПроверитьРавенство(500, СтрокаТЧ.Сумма,      "Не рассчиталась сумма");
	
	Форма._ПересчитатьКоличествоМест();
	
КонецПроцедуры	

&НаКлиенте
Процедура КоличествоМестОбеспечение() Экспорт
	
	Макет = ПолучитьМакет("ДанныеОбеспечение");
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет);
	
	ПровестиДокумент(СтруктураДанных.ПоступлениеТоваровИУслуг1);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СтруктураДанных.ЗаказКлиента1);
	
	Форма = ПолучитьФорму("Документ.ЗаказКлиента.ФормаОбъекта", ПараметрыФормы);
	Форма.Открыть();
	
	СтрокаТЧ = Форма.Объект.Товары[0];
	Форма.Элементы.Товары.ТекущаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
	
	Массив = Новый Массив;
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Требуется"));
	
	ФормаВыбора = ПолучитьФорму("Перечисление.ВариантыОбеспечения.Форма.ИсполнениеЗаказа",, Форма);
	ФормаВыбора.ОповеститьОВыборе(Массив);
	
	Утверждения.ПроверитьРавенство(2,  Форма.Объект.Товары.Количество(), "Не верное количество строк");
	Утверждения.ПроверитьРавенство(50, Форма.Объект.Товары.Итог("_КоличествоМест"), "Не верное итоговое количество мест");
	
	Форма.Модифицированность = Ложь;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ПровестиДокумент(Ссылка)
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьМакет(ИмяМакета = "Данные")
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
	
КонецФункции

