Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	//Получение КИ на пустуюДату
	НаборТестов.Добавить("СоздатьВТКонтактнаяИнформация");
	НаборТестов.Добавить("СоздатьВТКонтактнаяИнформацияНаПустуюДату");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьВТКонтактнаяИнформация() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Организация");
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Структура.Организация);
	
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УправлениеКонтактнойИнформацией.СоздатьВТКонтактнаяИнформация(МенеджерВременныхТаблиц, МассивОбъектов,, ВидыКИ, '2016-01-01');
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.ДействуетС КАК ДействуетС,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.ЗначенияПолей
	|ИЗ
	|	ВТКонтактнаяИнформация КАК КонтактнаяИнформация";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Значение = Таблица[0].Представление;
	
	Утверждения.ПроверитьРавенство(Значение, "Санкт-Петербург г", "Неверный адрес на 2016-01-01")
	
КонецПроцедуры

Процедура СоздатьВТКонтактнаяИнформацияНаПустуюДату() Экспорт
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Организация");
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Структура.Организация);
	
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УправлениеКонтактнойИнформацией.СоздатьВТКонтактнаяИнформация(МенеджерВременныхТаблиц, МассивОбъектов,, ВидыКИ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.ДействуетС КАК ДействуетС,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.ЗначенияПолей
	|ИЗ
	|	ВТКонтактнаяИнформация КАК КонтактнаяИнформация";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Значение = Таблица[0].Представление;
	
	Утверждения.ПроверитьРавенство(Значение, "Москва г", "Неверный адрес на пустую дату")
	
КонецПроцедуры
