Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

Перем СтруктураДанных;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
	СтруктураДанных = ПолучитьСтруктуруДанных();
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("ПТУ_Проведение");
	НаборТестов.Добавить("ПТУ_РегУчет");
	НаборТестов.Добавить("СчетФактура");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Процедура ПТУ_Проведение() Экспорт
	
	Для каждого ДокументСсылка из СтруктураДанных.МассивДокументов Цикл
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПТУ_РегУчет() Экспорт
	
	Для каждого ДокументСсылка из СтруктураДанных.МассивДокументов Цикл
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Дата, Организация");
	
		СтруктураРеквизиты = Новый Структура("Ссылка, Дата, Организация", ДокументСсылка, РеквизитыДокумента.Дата, РеквизитыДокумента.Организация);
		РеглУчетПроведениеСервер.ОтразитьДокумент(СтруктураРеквизиты, Истина);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура СчетФактура() Экспорт
	
	Для каждого ДокументСсылка из СтруктураДанных.МассивСчФ Цикл
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСтруктуруДанных()
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "ПТУ,СчетФактуры");
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Структура.ПоступлениеТоваровИУслуг1);
	МассивДокументов.Добавить(Структура.ПоступлениеТоваровИУслуг2);
	
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	МассивСчФ = Новый Массив;
	МассивДокументов.Добавить(Структура.СчФ1);
	МассивДокументов.Добавить(Структура.СчФ2);
	
	Структура.Вставить("МассивСчФ", МассивСчФ);
	
	Возврат Структура;
	
КонецФункции




