Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

Перем СтруктураДанных;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
	СтруктураДанных = ПолучитьСтруктуруДанных();
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("РасчетСебестоимости");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Процедура РасчетСебестоимости() Экспорт
	
	Запись = РегистрыСведений.РегламентныеЗаданияЗакрытияМесяца.СоздатьМенеджерЗаписи();
	Запись.ЗакрываемыйПериод = '2016-01-01';
	Запись.Организация       = СтруктураДанных.Организация;
	Запись.Период            = ТекущаяДата();
	Запись.Записать();
	
	ОбщегоНазначенияУТ.ВыполнитьЗакрытиеМесяца(СтруктураДанных.Организация);
	
	// Проверим проводки акта
	Текст = ПолучитьМакет("ПроводкиАкт").ПолучитьТекст();
	ПроводкиОригинал = ЗначениеИзСтрокиВнутр(Текст);
	
	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(СтруктураДанных.Акт);
	НаборЗаписей.Прочитать();
	
	ПроводкиТекущие = НаборЗаписей.Выгрузить();
	ПроводкиТекущие.Сортировать("СчетДт, ПодразделениеДт, СчетКт, ПодразделениеКт");
	
	//Сначала нужно научиться выгрузать проводки по предопределенным именам
	//УтвержденияПроверкаТаблиц.ПроверитьРавенствоТаблиц(ПроводкиОригинал, ПроводкиТекущие, "Не совпадают проводки акта");
	
КонецПроцедуры	

Процедура ОтразитьВРегУчете() Экспорт
	
	
КонецПроцедуры	

Функция ПолучитьСтруктуруДанных()
	
	Структура = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "Данные");
	
	Возврат Структура;
	
КонецФункции




