Перем юТест;
Перем СтруктураДанных;

#Область ЮнитТестирование

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("РасчетСебестоимости");
	//ВсеТесты.Добавить("ОтразитьВРегУчете");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ПередЗапускомНабораТестов() Экспорт
	
	СтруктураДанных = ПолучитьСтруктуруДанных();
	
КонецПроцедуры

Процедура ПослеЗапускаНабораТестов() Экспорт
	
	
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Процедура РасчетСебестоимости() Экспорт
	
	Запись = РегистрыСведений.РегламентныеЗаданияЗакрытияМесяца.СоздатьМенеджерЗаписи();
	Запись.ЗакрываемыйПериод = '2016-01-01';
	Запись.Организация       = СтруктураДанных.Организация;
	Запись.Период            = ТекущаяДата();
	Запись.Записать();
	
	ОбщегоНазначенияУТ.ВыполнитьЗакрытиеМесяца(СтруктураДанных.Организация);
	
	// Проверим проводки акта
	Текст = ПолучитьМакет("ПроводкиАкт").ПолучитьТекст();
	ПроводкиОригинал = ЗначениеИзСтрокиВнутр(Текст);
	
	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(СтруктураДанных.Акт);
	НаборЗаписей.Прочитать();
	
	ПроводкиТекущие = НаборЗаписей.Выгрузить();
	ПроводкиТекущие.Сортировать("СчетДт, ПодразделениеДт, СчетКт, ПодразделениеКт");
	
	юТест.ПроверитьРавенствоТаблиц(ПроводкиОригинал, ПроводкиТекущие, "Не совпадают проводки акта");
	
КонецПроцедуры	

Процедура ОтразитьВРегУчете() Экспорт
	
	
КонецПроцедуры	

Функция ПолучитьСтруктуруДанных()
	
	Структура = юТест.СоздатьДанныеПоМакетам(ЭтотОбъект, "Данные");
	
	Возврат Структура;
	
КонецФункции



