&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем ГенераторТестовыхДанных;
&НаКлиенте
Перем ЗапросыИзБД;
&НаКлиенте
Перем УтвержденияПроверкаТаблиц;

&НаКлиенте
Перем РаботаСДокументами;

&НаКлиенте
Перем Форма;

#Область ЮнитТестирование

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
	РаботаСДокументами = КонтекстЯдра.Плагин("Plugin_РаботаСДокументами");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("ЗачетАвансаНераспределенныеПлатежиБезДоговора");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаТеста() Экспорт
	
	Попытка
		Форма.Модифицированность = Ложь;
		Форма.Закрыть();
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Процедура ПровестиВыбранныеДокументы(СтруктураДанных)
	
	ДокументОбъект = СтруктураДанных.ЗаказКлиента1.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); //ЗаказКлиента1
	
	ДокументОбъект = СтруктураДанных.ПоступлениеБезналичныхДС1.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); //ПоступлениеДС
	
	ДокументОбъект = СтруктураДанных.ВзаимозачетЗадолженности1.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); //ВзаимозачетЗадолженности1
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаНераспределенныеПлатежиБезДоговора() Экспорт
	
	Макет = ПолучитьМакет("Ссылки");
	Ссылки = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет,,, Истина);
	РаботаСДокументами.УдалитьДокументыПоОрганизации(Ссылки.Организация);
	
	Макет = ПолучитьМакет();
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет,,, Истина);
	
	ПровестиВыбранныеДокументы(СтруктураДанных);
	
	ПараметрыФормы = Новый Структура("Документ", СтруктураДанных.ЗаказКлиента1);
	Форма = ПолучитьФорму("Обработка.ПомощникЗачетаОплат.Форма", ПараметрыФормы);
	Форма.Открыть();
	
	ДоступноКЗачету = Форма.Оплаты[0].ДоступноКЗачету;
	Утверждения.ПроверитьРавенство(ДоступноКЗачету, 2000, "Не верная сумма доступно к зачету");
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьЗаказ(ДокументДС)
	
	Возврат ДокументДС.РасшифровкаПлатежа[0].Заказ;
	
КонецФункции	

&НаСервере
Функция ПолучитьМакет(ИмяМакета = "Данные")
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
	
КонецФункции
