Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;
Перем РаботаСДокументами;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
	РаботаСДокументами = КонтекстЯдра.Плагин("Plugin_РаботаСДокументами");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("КомандаВИнтрефейсе");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура КомандаВИнтрефейсе() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы._ЗаданиеНаСмену;
	
	Результат = Метаданные.Подсистемы.Производство.Подсистемы.ВнутрицеховоеУправление2_1.Состав.Содержит(МетаданныеДокумента);;
	Утверждения.ПроверитьРавенство(Результат, Истина, "Подсистемы.ВнутрицеховоеУправление2_1");

	Результат = Метаданные.Подсистемы.Производство.Подсистемы.ВнутрицеховоеУправление2_1_СЗаголовком.Состав.Содержит(МетаданныеДокумента);;
	Утверждения.ПроверитьРавенство(Результат, Истина, "Подсистемы.ВнутрицеховоеУправление2_1_СЗаголовком");
	
КонецПроцедуры	
