Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;
Перем РаботаСДокументами;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
	РаботаСДокументами = КонтекстЯдра.Плагин("Plugin_РаботаСДокументами");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("РасширениеТипов");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура РасширениеТипов() Экспорт
	
	ТипДокумента = Тип("ДокументСсылка.ТаможеннаяДекларацияЭкспорт");
	
	Результат = Метаданные.ОпределяемыеТипы.ОбъектСДополнительнымиКомандами.Тип.СодержитТип(ТипДокумента);
	Утверждения.ПроверитьРавенство(Результат, Истина, "ОпределяемыеТипы.ОбъектСДополнительнымиКомандами");

	Результат = Метаданные.ОпределяемыеТипы.ВладелецПрисоединенныхФайлов.Тип.СодержитТип(ТипДокумента);
	Утверждения.ПроверитьРавенство(Результат, Истина, "ОпределяемыеТипы.ВладелецПрисоединенныхФайлов");
	
	Результат = Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип.СодержитТип(Тип("СправочникСсылка.ТаможеннаяДекларацияЭкспортПрисоединенныеФайлы"));
	Утверждения.ПроверитьРавенство(Результат, Истина, "ОпределяемыеТипы.ПрисоединенныйФайл");
	
	Результат = Метаданные.ОпределяемыеТипы.ПрисоединенныйФайлОбъект.Тип.СодержитТип(Тип("СправочникОбъект.ТаможеннаяДекларацияЭкспортПрисоединенныеФайлы"));
	Утверждения.ПроверитьРавенство(Результат, Истина, "ОпределяемыеТипы.ПрисоединенныйФайлОбъект");
	
КонецПроцедуры	
