&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем ГенераторТестовыхДанных;
&НаКлиенте
Перем ЗапросыИзБД;
&НаКлиенте
Перем УтвержденияПроверкаТаблиц;

&НаКлиенте
Перем Форма;

#Область ЮнитТестирование

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("СохранениеПечФормы");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаТеста() Экспорт
	
	Попытка
		Форма.Модифицированность = Ложь;
		Форма.Закрыть();
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СохранениеПечФормы() Экспорт
	
	ОбъектыПечати = Новый Массив;
	ОбъектыПечати.Добавить(ПолучитьСсылку());
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОбъектыПечати", ОбъектыПечати);
	
	Форма = ОткрытьФорму("ОбщаяФорма.СохранениеПечатнойФормы", СтруктураПараметров);
	
	Утверждения.ПроверитьРавенство(Форма.Элементы.ПапкаДляСохраненияФайлов.АвтоМаксимальнаяШирина, Ложь, "Не снята галка АвтоМаксимальнаяШирина");
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьСсылку()
	
	Возврат Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор);
	
КонецФункции
