
// { Plugin interface
&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат ЭтотОбъектНаСервере().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции
// } Plugin interface

// { Helpers
&НаСервере
Функция ЭтотОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
// } Helpers

&НаКлиенте
Процедура УдалитьДокументыПоОрганизации(Организация) Экспорт
	
	УдалитьДокументыПоОрганизацииСервер(Организация);	
	
КонецПроцедуры	

&НаСервере
Процедура УдалитьДокументыПоОрганизацииСервер(Организация)
	
	ЭтотОбъектНаСервере().УдалитьДокументыПоОрганизации(Организация);	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПровестиДокумент(Ссылка) Экспорт
	
	ПровестиДокументСервер(Ссылка);	
	
КонецПроцедуры	

&НаСервере
Процедура ПровестиДокументСервер(Ссылка)
	
	ЭтотОбъектНаСервере().ПровестиДокумент(Ссылка);	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПровестиДокументы(СсылкаИлиМассив) Экспорт
	
	ПровестиДокументСервер(СсылкаИлиМассив);	
	
КонецПроцедуры	

&НаСервере
Процедура ПровестиДокументыСервер(СсылкаИлиМассив)
	
	ЭтотОбъектНаСервере().ПровестиДокументы(СсылкаИлиМассив);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьМесяц(Организация, ЗакрываемыйПериод) Экспорт
	
	ЭтотОбъектНаСервере().ЗакрытьМесяц(Организация, ЗакрываемыйПериод);	
	
КонецПроцедуры