Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("КомандаПоступлениеДС");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура КомандаПоступлениеДС() Экспорт
	
	ОбъектМетаданного = Метаданные.ОбщиеКоманды._ПоступлениеДСОплатаОтКлиента;
	
	Результат = Метаданные.Подсистемы.Продажи.Подсистемы.РасчетыСКлиентами.Состав.Содержит(ОбъектМетаданного);
	Утверждения.ПроверитьРавенство(Результат, Истина, "Команда _ПоступлениеДСОплатаОтКлиента не содержится в подсистеме Продажи\РасчетыСКлиентами");
	
КонецПроцедуры
