&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем ГенераторТестовыхДанных;
&НаКлиенте
Перем ЗапросыИзБД;
&НаКлиенте
Перем УтвержденияПроверкаТаблиц;

#Область ЮнитТестирование

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("КопированиеСтрокиМатериалов");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КопированиеСтрокиМатериалов() Экспорт
	
	Макет = ПолучитьМакет();
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СтруктураДанных.МаршрутныйЛистПроизводства1);
	
	Форма = ПолучитьФорму("Документ.МаршрутныйЛистПроизводства.ФормаОбъекта", ПараметрыФормы);
	Форма.Открыть();
	
	Элемент = Форма.Элементы.МатериалыИУслугиКоличествоУпаковок;
	Утверждения.ПроверитьРавенство(Элемент.ТолькоПросмотр, Истина, "Норматив материалов доступен на редактирование");
	
	СтрокаТЧ = Форма.Объект.МатериалыИУслуги[Форма.Объект.МатериалыИУслуги.Количество() - 1];
	Форма.Элементы.МатериалыИУслуги.ТекущаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
	Форма.Элементы.МатериалыИУслуги.СкопироватьСтроку();
	
	СтрокаТЧ = Форма.Объект.МатериалыИУслуги[Форма.Объект.МатериалыИУслуги.Количество() - 1];
	Утверждения.ПроверитьРавенство(СтрокаТЧ.Количество, 0, "При копировании строки остался норматив");
	
	Форма.Закрыть();
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьМакет()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМакет("Данные");
	
КонецФункции

